# StructuralDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRunType..::..StructuralDepth Property
StairsRunType Class See Also
---
The structural depth of the stairs run, only available for monolithic stairs run.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double StructuralDepth { get; set; }
```

Visual Basic
---
```text
Public Property StructuralDepth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double StructuralDepth {
	double get ();
	void set (double value);
}
```

# ### Field Value
The structural depth of the stairs run, 0.0 if the stairs run is not monolithic.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for structuralDepth must be between 0 and 30000 feet. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The stairs run type is not a monolithic type so the data being set is not applicable. |

# See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace